In [1]:
#librerias a usar
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
#cargar archivo csv
data = pd.read_csv('inmuebles2.csv')
data.head(5)

,Unnamed: 0,Esta es una base de datos que describe las operaciones inmobiliarias de una empresa,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,0,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
1,1,1,2004-01-01 00:00:00,Parking,Alquiler,Lleida,291,2133903,2004-06-19 00:00:00,Carmen
2,2,2,2004-01-01 00:00:00,Local,Venta,Girona,185,1945424,2004-04-19 00:00:00,Pedro
3,3,3,2004-01-01 00:00:00,Oficina,Alquiler,Girona,82,NaN,2004-11-08 00:00:00,Joaquín
4,4,4,2004-01-02 00:00:00,Parking,Alquiler,Girona,285,NaN,2004-04-27 00:00:00,Jesús

In [8]:
#Eliminar primera fila o filas innecesarias
data1 = pd.read_csv('inmuebles2.csv', skiprows=1)
data1.head(5)

,0,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
0,1,1,2004-01-01 00:00:00,Parking,Alquiler,Lleida,291.0,2133903.0,2004-06-19 00:00:00,Carmen
1,2,2,2004-01-01 00:00:00,Local,Venta,Girona,185.0,1945424.0,2004-04-19 00:00:00,Pedro
2,3,3,2004-01-01 00:00:00,Oficina,Alquiler,Girona,82.0,NaN,2004-11-08 00:00:00,Joaquín
3,4,4,2004-01-02 00:00:00,Parking,Alquiler,Girona,285.0,NaN,2004-04-27 00:00:00,Jesús
4,5,5,2004-01-02 00:00:00,Suelo,Venta,Tarragona,152.0,185000.0,2004-07-10 00:00:00,María

In [10]:
#Eliminar columnas innecesarias con drop
#axis1 es para columnas y axis0 es para filas
data2 = data1.drop(['0','Referencia'], axis=1)
data2.head(5)

,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
0,2004-01-01 00:00:00,Parking,Alquiler,Lleida,291.0,2133903.0,2004-06-19 00:00:00,Carmen
1,2004-01-01 00:00:00,Local,Venta,Girona,185.0,1945424.0,2004-04-19 00:00:00,Pedro
2,2004-01-01 00:00:00,Oficina,Alquiler,Girona,82.0,NaN,2004-11-08 00:00:00,Joaquín
3,2004-01-02 00:00:00,Parking,Alquiler,Girona,285.0,NaN,2004-04-27 00:00:00,Jesús
4,2004-01-02 00:00:00,Suelo,Venta,Tarragona,152.0,185000.0,2004-07-10 00:00:00,María

In [11]:
#identificar valores nulos por columna
valores_nulos = data2.isnull().sum()
valores_nulos

Fecha Alta        2
Tipo              2
Operación         1
Provincia         4
Superficie        4
Precio Venta      6
Fecha Venta     578
Vendedor        578
dtype: int64

In [12]:
#Identificar valores nulos por data frame
valores_nulos = data2.isnull().sum().sum()
valores_nulos

np.int64(1175)

**Método de Sustitución por Valores Nulos**

In [14]:
#Realizamos una copia del data frame
data3 = data2.copy()

In [16]:
#Primer método de sustitución de valores nulos
#Sustituir valores nulos con promedio 
data3['Superficie'] = data3['Superficie'].fillna(round(data2['Superficie'].mean(),1))
valores_nulos = data3.isnull().sum()
valores_nulos

Fecha Alta        2
Tipo              2
Operación         1
Provincia         4
Superficie        0
Precio Venta      6
Fecha Venta     578
Vendedor        578
dtype: int64

In [17]:
#Segundo método de sustitución de valores nulos
#Sustituir valores nulos con la mediana 
data3['Precio Venta'] = data3['Precio Venta'].fillna(round(data2['Precio Venta'].median(),1))
valores_nulos = data3.isnull().sum()
valores_nulos

Fecha Alta        2
Tipo              2
Operación         1
Provincia         4
Superficie        0
Precio Venta      0
Fecha Venta     578
Vendedor        578
dtype: int64

In [21]:
#Tercer metodo para sustitucion en variables numericas
#susituir valores nulos por un valor numerico en concreto
data3['Fecha Alta'] = data3['Fecha Alta'].fillna(10)
valores_nulos = data3.isnull().sum()
valores_nulos

Fecha Alta        0
Tipo              2
Operación         1
Provincia         4
Superficie        0
Precio Venta      0
Fecha Venta     578
Vendedor        578
dtype: int64

In [22]:
#cuarto método de sustitución de valores nulos
#Sustituir valores nulos  por un string en concreto
data3['Fecha Venta'] = data3['Fecha Venta'].fillna('2030-06-19 00:00:00')
valores_nulos = data3.isnull().sum()
valores_nulos

Fecha Alta        0
Tipo              2
Operación         1
Provincia         4
Superficie        0
Precio Venta      0
Fecha Venta       0
Vendedor        578
dtype: int64

In [23]:
#Quinto método de sustitución de valores nulos
#Sustituir valores nulos por valores no nulos hacia adelante "foward fill"
#filtro por columna
data3['Tipo'] = data3['Tipo'].fillna(method='ffill')
valores_nulos = data3.isnull().sum()
valores_nulos

C:\Users\cesar\AppData\Local\Temp\ipykernel_22564\1808662535.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data3['Tipo'] = data3['Tipo'].fillna(method='ffill')

Fecha Alta        0
Tipo              0
Operación         1
Provincia         4
Superficie        0
Precio Venta      0
Fecha Venta       0
Vendedor        578
dtype: int64

In [24]:
#Sextp método de sustitución de valores nulos	
#Sustituir valores nulos por valores no nulos hacia atras "backward fill"
#filtro por columna
data3['Operación'] = data3['Operación'].fillna(method='bfill')
valores_nulos = data3.isnull().sum()
valores_nulos

C:\Users\cesar\AppData\Local\Temp\ipykernel_22564\2668890149.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data3['Operación'] = data3['Operación'].fillna(method='bfill')

Fecha Alta        0
Tipo              0
Operación         0
Provincia         4
Superficie        0
Precio Venta      0
Fecha Venta       0
Vendedor        578
dtype: int64

In [25]:
data3['Provincia'] = data3['Provincia'].fillna(method='bfill')
valores_nulos = data3.isnull().sum()
valores_nulos

C:\Users\cesar\AppData\Local\Temp\ipykernel_22564\1182096155.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data3['Provincia'] = data3['Provincia'].fillna(method='bfill')

Fecha Alta        0
Tipo              0
Operación         0
Provincia         0
Superficie        0
Precio Venta      0
Fecha Venta       0
Vendedor        578
dtype: int64

In [26]:
data3['Vendedor'] = data3['Vendedor'].fillna(method='ffill')
valores_nulos = data3.isnull().sum()
valores_nulos

C:\Users\cesar\AppData\Local\Temp\ipykernel_22564\261798344.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data3['Vendedor'] = data3['Vendedor'].fillna(method='ffill')

Fecha Alta      0
Tipo            0
Operación       0
Provincia       0
Superficie      0
Precio Venta    0
Fecha Venta     0
Vendedor        0
dtype: int64

**Método de eliminación por valores**

In [28]:
data4 = data2.copy()
valores_nulos = data4.isnull().sum()
valores_nulos

Fecha Alta        2
Tipo              2
Operación         1
Provincia         4
Superficie        4
Precio Venta      6
Fecha Venta     578
Vendedor        578
dtype: int64

In [30]:
#Eliminamos filas con nulos
#No se agrega nada para eliminar filas y 1 para eliminar columnas
data4 = data2.dropna()
valores_nulos = data4.isnull().sum()
valores_nulos

Fecha Alta      0
Tipo            0
Operación       0
Provincia       0
Superficie      0
Precio Venta    0
Fecha Venta     0
Vendedor        0
dtype: int64

**Comparamos DataFrame3(Sustitución) y DataFrame4(Eliminación)**

In [32]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3337 entries, 0 to 3336
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Fecha Alta    3337 non-null   object
 1   Tipo          3337 non-null   object
 2   Operación     3337 non-null   object
 3   Provincia     3337 non-null   object
 4   Superficie    3337 non-null   float64
 5   Precio Venta  3337 non-null   float64
 6   Fecha Venta   3337 non-null   object
 7   Vendedor      3337 non-null   object
dtypes: float64(2), object(6)
memory usage: 208.7+ KB

In [31]:
data4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2747 entries, 0 to 3045
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Fecha Alta    2747 non-null   object
 1   Tipo          2747 non-null   object
 2   Operación     2747 non-null   object
 3   Provincia     2747 non-null   object
 4   Superficie    2747 non-null   float64
 5   Precio Venta  2747 non-null   float64
 6   Fecha Venta   2747 non-null   object
 7   Vendedor      2747 non-null   object
dtypes: float64(2), object(6)
memory usage: 193.1+ KB

In [33]:
data3.to_csv('inmuebles_sin_nulos.csv')